app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "encrypted_password", "remember_token", "username") VALUES (?, ?, ?, ?, ?, ?)
---
  def create #how to do I create a user through the form. Take input variable -> put into database
  	@user = User.new(user_params)
  	if @user.save